InformationRegisters/MRS_ЛогИнтеграцииSimphony.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>MRS_ЛогИнтеграцииSimphony</Name>
			<Comment>Регистр для логирования всех запросов к Simphony API</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Comment>Дата и время запроса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь, инициировавший запрос</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Comment>Название операции (синхронизация, загрузка справочников и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектСинхронизации</Name>
					<Comment>Объект, который синхронизируется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPМетод</Name>
					<Comment>HTTP метод запроса (GET, POST, PUT и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗапроса</Name>
					<Comment>Полный URL запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Comment>HTTP код ответа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Comment>Тело HTTP запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Comment>Тело HTTP ответа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения запроса в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/MRS_СтатусыСинхронизацииМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>MRS_СтатусыСинхронизацииМеню</Name>
			<Comment>Регистр для отслеживания статусов синхронизации позиций меню с Simphony</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПозицияМеню</Name>
					<Comment>Ссылка на позицию меню</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MRS_Меню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Текущий статус синхронизации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>Дата и время последнего обновления статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Comment>Текст ошибки при синхронизации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDЗапроса</Name>
					<Comment>X-Request-Id из заголовков запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDКорреляции</Name>
					<Comment>X-Correlation-Id из заголовков запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/MRS_СтатусыСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>MRS_СтатусыСинхронизации</Name>
			<Comment>Статусы синхронизации позиций меню с Simphony</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
					<Comment>Позиция создана в 1С, но еще не синхронизирована</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
					<Comment>Запрос на синхронизацию отправлен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синхронизировано</Name>
					<Comment>Успешно синхронизировано с Simphony</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Ошибка при синхронизации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/MRS_ЛогированиеИнтеграцииСервер/Ext/Module.bsl
// Общий модуль MRS_ЛогированиеИнтеграцииСервер
// Назначение: Серверные функции для логирования операций интеграции с Simphony и управления статусами синхронизации
// Содержит: запись логов интеграции, обновление статусов синхронизации позиций меню

#Область ПрограммныйИнтерфейс

#Область ЛогированиеИнтеграции

// Записывает лог операции интеграции с Simphony в регистр сведений
//
// Параметры:
//   Операция - Строка - название операции (например, "Создание позиции меню", "Загрузка мажорных групп")
//   Объект - Строка - объект синхронизации (например, "MRS_Меню", "MRS_МажорнаяГруппа")
//   HTTPМетод - Строка - HTTP метод запроса (GET, POST, PUT, DELETE)
//   URL - Строка - URL запроса к API Simphony
//   КодОтвета - Число - HTTP код ответа (200, 400, 500 и т.д.)
//   ТелоЗапроса - Строка - тело HTTP-запроса (JSON)
//   ТелоОтвета - Строка - тело HTTP-ответа (JSON)
//   ВремяВыполнения - Число - время выполнения запроса в секундах
//
Процедура ЗаписатьЛогИнтеграции(Операция, Объект, HTTPМетод, URL, КодОтвета, ТелоЗапроса, ТелоОтвета, ВремяВыполнения) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.MRS_ЛогИнтеграцииSimphony.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ДатаВремя = ТекущаяДатаСеанса();
	
	Попытка
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	Исключение
		// Если модуль Пользователи недоступен, оставляем пустым
	КонецПопытки;
	МенеджерЗаписи.Операция = Операция;
	МенеджерЗаписи.ОбъектСинхронизации = Объект;
	МенеджерЗаписи.HTTPМетод = HTTPМетод;
	МенеджерЗаписи.URLЗапроса = URL;
	МенеджерЗаписи.КодОтвета = КодОтвета;
	МенеджерЗаписи.ТелоЗапроса = ТелоЗапроса;
	МенеджерЗаписи.ТелоОтвета = ТелоОтвета;
	МенеджерЗаписи.ВремяВыполнения = ВремяВыполнения;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеСтатусами

// Обновляет статус синхронизации позиции меню в регистре сведений
//
// Параметры:
//   ПозицияМеню - СправочникСсылка.MRS_Меню - ссылка на позицию меню
//   Статус - ПеречислениеСсылка.MRS_СтатусыСинхронизации - новый статус синхронизации:
//            * Создано - позиция создана, но не синхронизирована
//            * ВОбработке - синхронизация в процессе
//            * Синхронизировано - успешно синхронизировано
//            * Ошибка - ошибка при синхронизации
//   ТекстОшибки - Строка - текст ошибки (если Статус = Ошибка), по умолчанию пустая строка
//   IDЗапроса - Строка - X-Request-Id из заголовков запроса, по умолчанию пустая строка
//   IDКорреляции - Строка - X-Correlation-Id из заголовков запроса, по умолчанию пустая строка
//
Процедура ОбновитьСтатусСинхронизации(ПозицияМеню, Статус, ТекстОшибки = "", IDЗапроса = "", IDКорреляции = "") Экспорт
	
	МенеджерЗаписи = РегистрыСведений.MRS_СтатусыСинхронизацииМеню.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПозицияМеню = ПозицияМеню;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.ДатаОбновления = ТекущаяДатаСеанса();
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	МенеджерЗаписи.IDЗапроса = IDЗапроса;
	МенеджерЗаписи.IDКорреляции = IDКорреляции;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Получает текущий статус синхронизации позиции меню
//
// Параметры:
//   ПозицияМеню - СправочникСсылка.MRS_Меню - ссылка на позицию меню
//
// Возвращаемое значение:
//   Структура - информация о статусе синхронизации:
//     * Статус - ПеречислениеСсылка.MRS_СтатусыСинхронизации - текущий статус
//     * ДатаОбновления - Дата - дата последнего обновления статуса
//     * ТекстОшибки - Строка - текст последней ошибки (если есть)
//     * IDЗапроса - Строка - ID последнего запроса
//     * IDКорреляции - Строка - ID последней корреляции
//
Функция ПолучитьСтатусСинхронизации(ПозицияМеню) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", Перечисления.MRS_СтатусыСинхронизации.Создано);
	Результат.Вставить("ДатаОбновления", Дата(1, 1, 1));
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("IDЗапроса", "");
	Результат.Вставить("IDКорреляции", "");
	
	МенеджерЗаписи = РегистрыСведений.MRS_СтатусыСинхронизацииМеню.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПозицияМеню = ПозицияМеню;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Результат.Статус = МенеджерЗаписи.Статус;
		Результат.ДатаОбновления = МенеджерЗаписи.ДатаОбновления;
		Результат.ТекстОшибки = МенеджерЗаписи.ТекстОшибки;
		Результат.IDЗапроса = МенеджерЗаписи.IDЗапроса;
		Результат.IDКорреляции = МенеджерЗаписи.IDКорреляции;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает статус "ВОбработке" для массива позиций меню
//
// Параметры:
//   МассивПозиций - Массив из СправочникСсылка.MRS_Меню - массив ссылок на позиции меню
//
Процедура УстановитьСтатусВОбработке(МассивПозиций) Экспорт
	
	Для Каждого ПозицияМеню Из МассивПозиций Цикл
		
		ОбновитьСтатусСинхронизации(ПозицияМеню, Перечисления.MRS_СтатусыСинхронизации.ВОбработке);
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает статус "Синхронизировано" для массива позиций меню
//
// Параметры:
//   МассивПозиций - Массив из СправочникСсылка.MRS_Меню - массив ссылок на позиции меню
//   IDЗапроса - Строка - X-Request-Id из заголовков запроса
//   IDКорреляции - Строка - X-Correlation-Id из заголовков запроса
//
Процедура УстановитьСтатусСинхронизировано(МассивПозиций, IDЗапроса, IDКорреляции) Экспорт
	
	Для Каждого ПозицияМеню Из МассивПозиций Цикл
		
		ОбновитьСтатусСинхронизации(
			ПозицияМеню,
			Перечисления.MRS_СтатусыСинхронизации.Синхронизировано,
			"",
			IDЗапроса,
			IDКорреляции);
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает статус "Ошибка" для массива позиций меню
//
// Параметры:
//   МассивПозиций - Массив из СправочникСсылка.MRS_Меню - массив ссылок на позиции меню
//   ТекстОшибки - Строка - текст ошибки
//   IDЗапроса - Строка - X-Request-Id из заголовков запроса, по умолчанию пустая строка
//   IDКорреляции - Строка - X-Correlation-Id из заголовков запроса, по умолчанию пустая строка
//
Процедура УстановитьСтатусОшибка(МассивПозиций, ТекстОшибки, IDЗапроса = "", IDКорреляции = "") Экспорт
	
	Для Каждого ПозицияМеню Из МассивПозиций Цикл
		
		ОбновитьСтатусСинхронизации(
			ПозицияМеню,
			Перечисления.MRS_СтатусыСинхронизации.Ошибка,
			ТекстОшибки,
			IDЗапроса,
			IDКорреляции);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
